Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can also fine-tune dialect behavior for specific databases using additional properties, such as:
ja_jp: 次のような追加のプロパティーを使用して、特定のデータベースに合わせてダイアレクトの動作を微調整することもできます。

source: You can also generate the native executable using:
ja_jp: 次のようにネイティブ実行可能ファイルを生成することもできます:

source: You can also generate the native executable with:
ja_jp: 次のようにネイティブ実行可能ファイルを生成することもできます。

source: You can also generate this example with the Quarkus CLI:
ja_jp: この例は、Quarkus CLIで生成することもできます:

source: You can also get access to the underlying `graphql-java` during schema generation, to add your own features directly:
ja_jp: また、スキーマ生成時に基盤となる `graphql-java` にアクセスして、独自の機能を直接追加することもできます。

source: You can also get the Kafka configuration injected to your application and create Kafka producer, consumer and admin clients directly:
ja_jp: Kafka 設定をアプリケーションに注入して、Kafka プロデューサー、コンシューマー、および管理クライアントを直接作成することもできます。

source: You can also get the certificate by using the code outlined in the following example:
ja_jp: 次の例に示すコードを使用して証明書を取得することもできます。

source: You can also go back to the original (vanilla) Swagger UI theme:
ja_jp: また、元の(バニラの)Swagger UIテーマに戻すこともできます:

source: You can also have _httpie_ automatically follow the redirect by passing the `--follow option`:
ja_jp: また、 `--follow option` を渡すことで _httpie_ が自動的にリダイレクトに従うようにすることもできます:

source: You can also have a look at this week's Quarkus Insights `Quarkus 2.0 Launch Party`, with several Quarkus contributors talking about the new features.
ja_jp: また、今週のQuarkus Insights `Quarkus 2.0 Launch Party` で、複数のQuarkusコントリビューターが新機能について語っていますので、ご覧ください。

source: You can also https://infinispan.org/download/[download] {infinispan-version} Server bare metal distribution and run the following command from the distribution folder.
ja_jp: また、{Infinispan-version} サーバー ベアメタルディストリビューションを link:https://infinispan.org/download/[ダウンロード] することが出来、ディストリビューションフォルダで以下のコマンドを実行します。

source: You can also implement the `io.quarkus.vertx.web.ReactiveRoutes.ServerSentEvent` interface to customize the `event` and `id` section of the server sent event:
ja_jp: `io.quarkus.vertx.web.ReactiveRoutes.ServerSentEvent` インターフェイスを実装して、サーバー送信イベントの `event` および `id` セクションをカスタマイズすることもできます。

source: You can also import other functions if needed
ja_jp: 必要に応じて他の関数をインポートすることもできます。

source: You can also include a fragment with an `{#include}` section inside another template or the template that defines the fragment.
ja_jp: また、 `{#include}` セクションを持つフラグメントを、別のテンプレートやフラグメントを定義するテンプレートの中に含めることもできます。

source: You can also include a fragment with an `{#include}` section inside another template or the template that defines the fragment. A fragment can be also used in expressions with the `frg:`/`fragment:` namespaces.
ja_jp: また、 `{#include}` セクションを持つフラグメントを、別のテンプレートや、フラグメントを定義したテンプレートの中に含めることもできます。 フラグメントは、 `frg:` / `fragment:` 名前空間を持つ式でも使用できます。

source: You can also inject `CompletationStage<QuarkusCqlSession>` or `Uni<QuarkusCqlSession>`.
ja_jp: `CompletationStage<QuarkusCqlSession>` や `Uni<QuarkusCqlSession>` を注入することも可能です。

source: You can also inject `CompletionStage<QuarkusCqlSession>` or `Uni<QuarkusCqlSession>`.
ja_jp: `CompletionStage<QuarkusCqlSession>` または `Uni<QuarkusCqlSession>` を注入することもできます。

source: You can also inject a `CompletionStage` or `Uni` of any `@Mapper`-annotated interface.
ja_jp: `@Mapper` アノテーション付きインタフェースの `CompletionStage` または `Uni` を注入することもできます。

source: You can also inject a configured `org.jboss.logging.Logger` instance in your beans and resource classes.
ja_jp: また、設定済みの `org.jboss.logging.Logger` インスタンスを Bean やリソースクラスに注入することもできます。

source: You can also inject a custom-built `ThreadContext` using the https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/ThreadContextConfig.html[`@ThreadContextConfig`] annotation on your injection point:
ja_jp: また、インジェクションポイントに link:https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/ThreadContextConfig.html[`@ThreadContextConfig`]アノテーションを使うことでカスタムメイドの `ThreadContext` を注入することもできます:

source: You can also inject a list of bean instances wrapped in `io.quarkus.arc.InstanceHandle`. This can be useful if you need to inspect the related bean metadata.
ja_jp: `io.quarkus.arc.InstanceHandle` でラップされた Bean インスタンスのリストを注入することもできます。これは、関連する Bean メタデータを検査する必要がある場合に役立ちます。

source: You can also inject an instance of `Uni<Mutiny.Session>` using the exact same mechanism:
ja_jp: また、全く同じ仕組みで `Uni<Mutiny.Session>` のインスタンスを注入することもできます。

source: You can also inject named `Tokens`, see <<named-oidc-clients,Inject named OidcClient and Tokens>>
ja_jp: また、名前付きの `Tokens` を注入することもできます。<<named-oidc-clients,Inject named OidcClient and Tokens>> を参照してください。

source: You can also inject named `Tokens`, see xref:named-oidc-clients[Inject named OidcClient and Tokens]
ja_jp: また、名前付きの `Tokens` の注入も可能です。 xref:named-oidc-clients[名前付きOidcClient とトークンの注入] を参照してください。

source: You can also inject those context objects using https://javadoc.io/static/javax.inject/javax.inject/1/javax/inject/Inject.html[`@Inject`] on fields of the same type:
ja_jp: 同じタイプのフィールドに https://javadoc.io/static/javax.inject/javax.inject/1/javax/inject/Inject.html[`@Inject`] を使用して、これらのコンテキストオブジェクトを挿入することもできます。

source: You can also inject those context objects using {injectapi}/jakarta/inject/Inject.html[`@Inject`] on fields of the same type:
ja_jp: これらのコンテキスト・オブジェクトは、{injectapi}/jakarta/inject/Inject.html[ `@Inject` ] を使って、同じ型のフィールドに注入することもできます：

source: You can also interact with your API in order to quickly test it. image:openapi-swaggerui-guide-screenshot02.png[alt=Interact with your API]
ja_jp: また、APIを素早くテストするためにAPIと対話することもできます。 image:openapi-swaggerui-guide-screenshot02.png[alt="Interact with your API"]

source: You can also intercept OIDC redirect requests.
ja_jp: OIDC リダイレクト要求をインターセプトすることもできます。

source: You can also invoke the _descriptive_ endpoint, that will provide also the _OutputField_ evaluated:
ja_jp: また、_descriptive_ エンドポイントを呼び出すこともでき、その場合は _OutputField_ の評価も提供されます:

source: You can also just add the following dependency into your project:
ja_jp: また、以下の依存関係をプロジェクトに追加することでもできます。

source: You can also let Maven control the deployment of your application using the App Engine Maven plugin.
ja_jp: また、App Engine Mavenプラグインを使用して、Mavenでアプリケーションのデプロイを制御することもできます。

source: You can also link to an "internal" page (as opposed to the above "external" page). This means that you can build the page and add data and actions for rendering in Dev UI.
ja_jp: "内部" ページ (上記の "外部" ページとは対照的) にリンクすることもできます。つまり、ページをビルドし、Dev UI でレンダリングするためのデータとアクションを追加できます。

source: You can also link:{jaxrsspec}#filters[declare request and response filters in the JAX-RS way].
ja_jp: link:{jaxrsspec}#filters[JAX-RS方式でリクエストフィルタ、レスポンスフィルタを宣言する]こともできます。

source: You can also link:{jaxrsspec}#filters[declare request and response filters in the Jakarta REST way].
ja_jp: link:{jaxrsspec}#filters[JAX-RS方式でリクエストフィルター、レスポンスフィルターを宣言する]こともできます。

source: You can also list extensions for a specific release of Quarkus using `-P` or `-S`, as described in <<specifying-quarkus-version>>.
ja_jp: <<specifying-quarkus-version>> で説明されているとおり、 `-P` または `-S` を使用して、Quarkus の特定リリースのエクステンションをリストすることもできます。

source: You can also map `SecurityIdentity` roles created from token claims to deployment-specific roles by using the xref:security-authorize-web-endpoints-reference.adoc#map-security-identity-roles[HTTP Security policy].
ja_jp: また、xref:security-authorize-web-endpoints-reference.adoc#map-security-identity-roles[HTTP セキュリティーポリシー] を使用して、トークンクレームから作成された `SecurityIdentity` ロールをデプロイメント固有のロールにマップすることもできます。

source: You can also now disable them at runtime.
ja_jp: また、実行時にそれらを無効にすることもできます。

source: You can also only put the trace info into the access log. In this case you must omit the info in the console log format.
ja_jp: また、アクセスログにのみトレース情報を記載することもできます。この場合、コンソールログ形式の情報を省略する必要があります。

source: You can also package the application in a container.
ja_jp: また、アプリケーションをコンテナにパッケージすることもできます。

source: You can also pass any property supported by the underlying https://kafka.apache.org/documentation/#consumerconfigs[Kafka consumer].
ja_jp: 基盤となる https://kafka.apache.org/documentation/#consumerconfigs[Kafka consumer] でサポートされる任意のプロパティーを渡すこともできます。

source: You can also pass any property supported by the underlying https://kafka.apache.org/documentation/#producerconfigs[Kafka producer].
ja_jp: 基盤となる https://kafka.apache.org/documentation/#producerconfigs[Kafka producer] でサポートされている任意のプロパティーを渡すこともできます。

source: You can also pass in parameters in the method being called, for example: (In the Runtime Java code)
ja_jp: 呼び出されるメソッドにパラメーターを渡すこともできます。以下はその例です (ランタイム Java コード内)。

source: You can also programmatically ask for a transaction to be marked for rollback. Inject a `TransactionManager` for this.
ja_jp: また、プログラムでトランザクションにロールバックのマークを付けることもできます。そのためには `TransactionManager` をインジェクトします。

source: You can also provide duration values starting with a number. In this case, if the value consists only of a number, the converter treats the value as seconds. Otherwise, `PT` is implicitly prepended to the value to obtain a standard `java.time.Duration` format.
ja_jp: 数値で始まる期間の値を指定することもできます。この場合、値が数値のみで構成されている場合、コンバーターは値を秒として扱います。そうでない場合は、 `PT` が暗黙的に値の前に付加され、標準の `java.time.Duration` 形式が得られます。

source: You can also provide strings instead of Objects, in that case the strings will be wrapped in quotes to become valid JSON values:
ja_jp: オブジェクトの代わりに文字列を指定することもできます。その場合、文字列を引用符で囲うことで、有効な JSON 値になります。

source: You can also provide strings instead of objects, in that case the strings will be wrapped in quotes to become valid JSON values:
ja_jp: オブジェクトの代わりに文字列を指定することもできます。その場合、文字列を引用符で囲うことで、有効な JSON 値になります。

source: You can also provide your own application entry point annotated with `QuarkusMain` (as described in xref:command-mode-reference.adoc[Command Mode reference guide]).
ja_jp: また、 `QuarkusMain` でアノテーションされた独自のアプリケーションのエントリーポイントを提供することもできます (link:command-mode-reference[コマンドモードのリファレンスガイド] に記載されています)。

source: You can also query by key
ja_jp: キーによるクエリも可能です

source: You can also receive the Mutiny variant of the Router (`io.vertx.mutiny.ext.web.Router`):
ja_jp: ルーターの Mutiny バリアント (`io.vertx.mutiny.ext.web.Router`) を受け取ることもできます。

source: You can also register a listener programmatically with an injected `org.quartz.Scheduler`:
ja_jp: インジェクトされた `org.quartz.Scheduler` でリスナーをプログラムで登録することも出来ます:

source: You can also register filters that would intercept incoming HTTP requests. Note that these filters are also applied for servlets, JAX-RS resources, and reactive routes.
ja_jp: 受信 HTTP リクエストをインターセプトするフィルターを登録することもできます。これらのフィルターは、サーブレット、JAX-RS リソース、およびReactive Routesにも適用されることに注意してください。

source: You can also register filters that would intercept incoming HTTP requests. Note that these filters are also applied for servlets, Jakarta REST resources, and reactive routes.
ja_jp: また、受信した HTTP リクエストをインターセプトするようなフィルターを登録することも可能です。なお、これらのフィルタは、サーブレット、jakarta RESTリソース、リアクティブルートにも適用されます。

source: You can also register your route directly on the _HTTP routing layer_ by registering routes directly on the `Router` object. To retrieve the `Router` instance at startup:
ja_jp: ルートを `Router` オブジェクトに直接登録することにより、ルートを _HTTP ルーティングレイヤー_ に直接登録することもできます。起動時に `Router` インスタンスを取得するには、以下を実行します。

source: You can also remove the `app.kubernetes.io/version` label by applying the following configuration:
ja_jp: 以下の設定を適用することで、`app.kubernetes.io/version` のラベルを削除することもできます。

source: You can also remove the limit of in-flight messages by setting `max-inflight-messages` to `0`. However, note that the Kafka producer may block if the number of requests reaches `max.in.flight.requests.per.connection`.
ja_jp: `max-inflight-messages` を `0` に設定することで、インフライトメッセージの制限を解除することもできます。ただし、リクエスト数が `max.in.flight.requests.per.connection` に達すると、Kafka プロデューサーがブロックする可能性があることに注意してください。

source: You can also remove the limit of pending messages by setting `maxPendingMessages` to `0`. Note that Pulsar also enables to configure the number of pending messages per partition using `maxPendingMessagesAcrossPartitions`.
ja_jp: また、 `maxPendingMessages` を `0` に設定することで、保留メッセージの制限を解除することもできます。 Pulsar では、 `maxPendingMessagesAcrossPartitions` を使用して、パーティションごとの保留メッセージの数を設定することもできます。

source: You can also retrieve the password from Vault by link:{vault-datasource-guide}[using a credential provider] for your datasource.
ja_jp: また、データソースに link:{vault-datasource-guide}[クレデンシャルプロバイダ]を使用することで、Vault からパスワードを取得することもできます。

source: You can also retry the operation such as in:
ja_jp: 以下のようにして操作をリトライすることもできます。

source: You can also return a `CompletableFuture`/`CompletionStage` as an action, and if you want to stream data you need to use `addSubscription` (rather than `addAction`) and return a `Flow.Publisher`.
ja_jp: アクションとして `CompletableFuture`/`CompletionStage` を返すこともできます。データをストリーミングする場合は、 `addAction` ではなく `addSubscription` を使用して `Flow.Publisher` を返す必要があります。

source: You can also return a `CompletableFuture`/`CompletionStage` as an action, and if you want to stream data you need to use `addSubscription` (rather than `addAction`) and return a `Flow.Publisher`. Here you can not use Uni and Multi as we need to pass data between the deployment and runtime classpaths, so sticking to JDK classes is the safe option.
ja_jp: アクションとして `CompletableFuture`/`CompletionStage` を返すこともできます。データをストリーミングする場合は、 `addAction` ではなく `addSubscription` を使用して `Flow.Publisher` を返す必要があります。デプロイメントとランタイムのクラスパス間でデータを渡す必要があるため、Uni と Multi は使用できません。したがって、JDK クラスを使用するのが安全なオプションです。

source: You can also return a `Uni<T>` or a `CompletionStage<T>` to handle asynchronous reply:
ja_jp: また、 `Uni<T>` や `CompletionStage<T>` を返すことで、非同期レスポンスを扱うことも可能です。

source: You can also return a result directly:
ja_jp: 結果を直接返すこともできます。

source: You can also revoke tokens in the security event listeners.
ja_jp: セキュリティイベントリスナーでトークンを取り消すこともできます。

source: You can also run a Quarkus application in debug mode with a suspended JVM using:
ja_jp: また、JVMをサスペンドした状態で、デバッグモードでQuarkusアプリケーションを実行することもできます。

source: You can also run the test from your IDE directly (be sure you stopped the application first).
ja_jp: また、IDE から直接テストを実行することもできます (最初にアプリケーションを停止したことを確認してください)。

source: You can also secure your endpoints with the `@PermissionsAllowed` security annotation like in the example below:
ja_jp: また、以下の例のように、 `@PermissionsAllowed` セキュリティーアノテーションを使用してエンドポイントを保護することもできます。

source: You can also send JSON multiparts by specifying the `@PartType` annotation:
ja_jp: また、 `@PartType` アノテーションを指定することで、JSON のマルチパートも送信できます。

source: You can also send access tokens issued by GitHub to `quarkus.oidc.application-type=service` or `quarkus.oidc.application-type=hybrid` Quarkus applications.
ja_jp: また、GitHub が発行したアクセストークンを、 `quarkus.oidc.application-type=service` または `quarkus.oidc.application-type=hybrid` Quarkus アプリケーションに送信することもできます。

source: You can also send access tokens issued by Google to `quarkus.oidc.application-type=service` or `quarkus.oidc.application-type=hybrid` Quarkus applications.
ja_jp: また、Google が発行したアクセストークンを、 `quarkus.oidc.application-type=service` または `quarkus.oidc.application-type=hybrid` Quarkus アプリケーションに送信することもできます。

source: You can also send access tokens issued by Microsoft to `quarkus.oidc.application-type=service` or `quarkus.oidc.application-type=hybrid` Quarkus applications but you may need to set `quarkus.oidc.verify-access-token-with-user-info` configuration property to `true` if access tokens issued by Microsoft are not in JWT format.
ja_jp: Microsoft が発行したアクセストークンを `quarkus.oidc.application-type=service` または `quarkus.oidc.application-type=hybrid` Quarkus アプリケーションに送信することもできますが、Microsoft が発行したアクセストークンが JWT 形式でない場合は、 `quarkus.oidc.verify-access-token-with-user-info` 設定プロパティーを `true` に設定する必要がある場合があります。

source: You can also send access tokens issued by `GitHub` to `quarkus.oidc.application-type=service` or `quarkus.oidc.application-type=hybrid` Quarkus applications.
ja_jp: また、 `GitHub` が発行したアクセストークンを、 `quarkus.oidc.application-type=service` または `quarkus.oidc.application-type=hybrid` Quarkus アプリケーションに送信することもできます。

source: You can also send several `Mail` objects in one call:
ja_jp: また、1回の呼び出しで複数の `Mail` オブジェクトを送信することもできます:

source: You can also send your logs to Fluentd using a Syslog input. As opposed to the GELF input, the Syslog input will not render multiline logs in one event, that's why we advise to use the GELF input that we implement in Quarkus.
ja_jp: Syslog入力を使ってFluentdにログを送ることもできます。GELF入力とは対照的に、Syslog入力は1つのイベントで複数行のログをレンダリングすることができないため、Quarkusで実装されているGELF入力を使用することをお勧めします。

source: You can also set Dev Services properties to create named datasources as described in the xref:databases-dev-services.adoc[Dev Services for Databases] guide.
ja_jp: xref:databases-dev-services.adoc[Dev Services for Databases] ガイドで説明されているように、Dev Services プロパティーを設定して名前付きデータソースを作成することもできます。

source: You can also set a `quarkus.oidc.authentication.cookie-path-header` property if the cookie path needs to be set dynamically. For example, setting `quarkus.oidc.authentication.cookie-path-header=X-Forwarded-Prefix` means that the value of HTTP `X-Forwarded-Prefix` header will be used to set a cookie path.
ja_jp: クッキーパスを動的に設定する必要がある場合は、 `quarkus.oidc.authentication.cookie-path-header` プロパティを設定することもできます。例えば、 `quarkus.oidc.authentication.cookie-path-header=X-Forwarded-Prefix` を設定すると、HTTP `X-Forwarded-Prefix` ヘッダーの値がクッキーパスを設定するために使用されることを意味します。

source: You can also set the HTML title, and add a footer:
ja_jp: HTMLタイトルを設定したり、フッターを追加したりすることもできます:

source: You can also simply add a file to Cloud Storage using the command line of the web console.
ja_jp: また、Web コンソールのコマンドラインを使用して、Cloud Storage にファイルを追加するだけでも簡単にできます。

source: You can also specify a `path` pattern and the HTTP `methods` the header needs to be applied:
ja_jp: また、ヘッダーを適用する必要がある `path` パターンと HTTP `methods` を指定することもできます。

source: You can also specify a different Cognito claim to extract roles from:
ja_jp: また、ロールを抽出するために、別のCognitoクレームを指定することもできます：

source: You can also specify how many times a log message should appear by setting the numeric suffix value: `io.quarkus.devservices.compose.wait_for.logs.3: .\*Worker started.*`
ja_jp: 数値サフィックスの値を設定することで、ログメッセージが何回表示されるべきかを指定することもできます: `io.quarkus.devservices.compose.wait_for.logs.3: .\*Worker started.*`

source: You can also specify the "wait time". If it's not possible to acquire the lock in the given time a `LockException` is thrown.
ja_jp: また、「待ち時間」を指定することもできます。指定した時間内にロックを取得できない場合は `LockException` が発生します。

source: You can also store passwords by using a different hashing algorithm, for example, `@Password(value = PasswordType.CUSTOM, provider = CustomPasswordProvider.class)`, as outlined in the following code snippet:
ja_jp: また、例えば `@Password(value = PasswordType.CUSTOM, provider = CustomPasswordProvider.class)` といった形で別のハッシュアルゴリズムを使ってパスワードを保存することもできます:

source: You can also store roles in another entity:
ja_jp: また、別のエンティティーにロールを格納することもできます。

source: You can also test your web socket applications using the approach detailed link:{quickstarts-blob-url}/websockets-quickstart/src/test/java/org/acme/websockets/ChatTest.java[here].
ja_jp: また、link:{quickstarts-blob-url}/websockets-quickstart/src/test/java/org/acme/websockets/ChatTest.java[ここ] で説明されたアプローチを使用したWebソケットアプリケーションをテストすることもできます。

source: You can also test your web socket applications using the approach detailed {quickstarts-blob-url}/websockets-quickstart/src/test/java/org/acme/websockets/ChatTest.java[here].
ja_jp: また、{quickstarts-blob-url}/websockets-quickstart/src/test/java/org/acme/websockets/ChatTest.java[こちら]で詳細に解説された手法を使用して、Webソケットアプリケーションをテストすることもできます。

source: You can also try calling the same URL with a different city and see the cache in action again. The first call will take six seconds and the following ones will be answered immediately.
ja_jp: また、同じURLを別の都市で呼び出してみて、再度キャッシュの動作を確認することもできます。最初の呼び出しには6秒ほどかかり、次の呼び出しにはすぐに出ます。

source: You can also try calling the same URL with a different city and see the cache in action again. The first call will take six seconds, and the following ones will be answered immediately.
ja_jp: 別の都市で同じ URL を呼び出して、再度キャッシュが動作するのを確認できます。最初の呼び出しには 6 秒かかり、その後の呼び出しにはすぐに応答します。

source: You can also use <<Use stateless sessions,Panache Stateless repositories>> or <<Reactive and stateless,Panache Stateless Reactive repositories>>.
ja_jp: <<Use stateless sessions,Panache ステートレスリポジトリ>> または <<Reactive and stateless,Panache ステートレスリアクティブリポジトリ>> を使用することもできます。

source: You can also use GitHub provider with `quarkus.oidc.application-type=service`, just set `quarkus.oidc.verify-access-token-with-user-info` configuration property to `true`.
ja_jp: `quarkus.oidc.application-type=service` とし、 `quarkus.oidc.verify-access-token-with-user-info` の設定プロパティを `true` に設定するだけでもGitHubプロバイダを使用できます。

source: You can also use JSON in the YAML file to describe the configuration. Use a single format per file. The file extension is either `yaml` or `yml`.
ja_jp: YAML ファイル内で JSON を使用して設定を記述することもできます。ファイルごとに単一の形式を使用してください。ファイル拡張子は `.yaml` または `.yml` です。

source: You can also use MicroProfile `ConfigSource` to fetch the keys from the external services such as link:{vault-guide}[HashiCorp Vault] or other secret managers and use `smallrye.jwt.sign.key` and `smallrye.jwt.encrypt.key` properties instead:
ja_jp: MicroProfile `ConfigSource` を使用して、link:{vault-guide}[HashiCorp Vault] や他のシークレットマネージャーなどの外部サービスからキーを取得し、代わりに `smallrye.jwt.sign.key` プロパティーと `smallrye.jwt.encrypt.key` プロパティーを使用することもできます。

source: You can also use Wiremock to mock the authorization OAuth2 and OIDC services: See xref:security-oauth2#integration-testing.adoc[OAuth2 Integration testing], xref:security-openid-connect.adoc#integration-testing-wiremock[OpenID Connect Bearer Token Integration testing], xref:security-openid-connect-web-authentication.adoc#integration-testing-wiremock[OpenID Connect Authorization Code Flow Integration testing] and xref:security-jwt.adoc#integration-testing-wiremock[SmallRye JWT Integration testing] for more details.
ja_jp: また、Wiremockを使って認可用のOAuth2やOIDCサービスをモックすることもできます。詳細は、 link:security-oauth2.html#integration-testing.adoc[OAuth2 Integration testing]、 link:security-openid-connect.html#integration-testing-wiremock[OpenID Connect Bearer Token Integration testing]、 link:security-openid-connect-web-authentication.html#integration-testing-wiremock[OpenID Connect Authorization Code Flow Integration testing]、 link:security-jwt.html#integration-testing-wiremock[SmallRye JWT Integration testing]を参照してください。

source: You can also use Wiremock to mock the authorization OAuth2 and OIDC services: See xref:security-oauth2.adoc#integration-testing[OAuth2 Integration testing], xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing-wiremock[OpenID Connect Bearer Token Integration testing], xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing-wiremock[OpenID Connect Authorization Code Flow Integration testing] and xref:security-jwt.adoc#integration-testing-wiremock[SmallRye JWT Integration testing] for more details.
ja_jp: Wiremockを使用して認可OAuth2とOIDCサービスをモックすることもできます。 詳細は xref:security-oauth2.adoc#integration-testing[OAuth2 結合テスト]、xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing-wiremock[OpenID Connect ベアラートークン結合テスト], xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing-wiremock[OpenID Connect 認可コードフロー結合テスト] and xref:security-jwt.adoc#integration-testing-wiremock[SmallRye JWT 結合テスト] を参照してください。
